; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p14---int100n150-m25---int100c110---s328---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level13 level13)
(sum level0 level14 level14)
(sum level0 level15 level15)
(sum level0 level20 level20)
(sum level0 level23 level23)
(sum level1 level4 level5)
(sum level1 level13 level14)
(sum level1 level14 level15)
(sum level1 level15 level16)
(sum level1 level20 level21)
(sum level1 level23 level24)
(sum level2 level4 level6)
(sum level2 level13 level15)
(sum level2 level14 level16)
(sum level2 level15 level17)
(sum level2 level20 level22)
(sum level2 level23 level25)
(sum level3 level4 level7)
(sum level3 level13 level16)
(sum level3 level14 level17)
(sum level3 level15 level18)
(sum level3 level20 level23)
(sum level3 level23 level26)
(sum level4 level4 level8)
(sum level4 level13 level17)
(sum level4 level14 level18)
(sum level4 level15 level19)
(sum level4 level20 level24)
(sum level4 level23 level27)
(sum level5 level4 level9)
(sum level5 level13 level18)
(sum level5 level14 level19)
(sum level5 level15 level20)
(sum level5 level20 level25)
(sum level5 level23 level28)
(sum level6 level4 level10)
(sum level6 level13 level19)
(sum level6 level14 level20)
(sum level6 level15 level21)
(sum level6 level20 level26)
(sum level6 level23 level29)
(sum level7 level4 level11)
(sum level7 level13 level20)
(sum level7 level14 level21)
(sum level7 level15 level22)
(sum level7 level20 level27)
(sum level7 level23 level30)
(sum level8 level4 level12)
(sum level8 level13 level21)
(sum level8 level14 level22)
(sum level8 level15 level23)
(sum level8 level20 level28)
(sum level8 level23 level31)
(sum level9 level4 level13)
(sum level9 level13 level22)
(sum level9 level14 level23)
(sum level9 level15 level24)
(sum level9 level20 level29)
(sum level9 level23 level32)
(sum level10 level4 level14)
(sum level10 level13 level23)
(sum level10 level14 level24)
(sum level10 level15 level25)
(sum level10 level20 level30)
(sum level10 level23 level33)
(sum level11 level4 level15)
(sum level11 level13 level24)
(sum level11 level14 level25)
(sum level11 level15 level26)
(sum level11 level20 level31)
(sum level11 level23 level34)
(sum level12 level4 level16)
(sum level12 level13 level25)
(sum level12 level14 level26)
(sum level12 level15 level27)
(sum level12 level20 level32)
(sum level12 level23 level35)
(sum level13 level4 level17)
(sum level13 level13 level26)
(sum level13 level14 level27)
(sum level13 level15 level28)
(sum level13 level20 level33)
(sum level13 level23 level36)
(sum level14 level4 level18)
(sum level14 level13 level27)
(sum level14 level14 level28)
(sum level14 level15 level29)
(sum level14 level20 level34)
(sum level14 level23 level37)
(sum level15 level4 level19)
(sum level15 level13 level28)
(sum level15 level14 level29)
(sum level15 level15 level30)
(sum level15 level20 level35)
(sum level15 level23 level38)
(sum level16 level4 level20)
(sum level16 level13 level29)
(sum level16 level14 level30)
(sum level16 level15 level31)
(sum level16 level20 level36)
(sum level16 level23 level39)
(sum level17 level4 level21)
(sum level17 level13 level30)
(sum level17 level14 level31)
(sum level17 level15 level32)
(sum level17 level20 level37)
(sum level17 level23 level40)
(sum level18 level4 level22)
(sum level18 level13 level31)
(sum level18 level14 level32)
(sum level18 level15 level33)
(sum level18 level20 level38)
(sum level18 level23 level41)
(sum level19 level4 level23)
(sum level19 level13 level32)
(sum level19 level14 level33)
(sum level19 level15 level34)
(sum level19 level20 level39)
(sum level19 level23 level42)
(sum level20 level4 level24)
(sum level20 level13 level33)
(sum level20 level14 level34)
(sum level20 level15 level35)
(sum level20 level20 level40)
(sum level20 level23 level43)
(sum level21 level4 level25)
(sum level21 level13 level34)
(sum level21 level14 level35)
(sum level21 level15 level36)
(sum level21 level20 level41)
(sum level21 level23 level44)
(sum level22 level4 level26)
(sum level22 level13 level35)
(sum level22 level14 level36)
(sum level22 level15 level37)
(sum level22 level20 level42)
(sum level22 level23 level45)
(sum level23 level4 level27)
(sum level23 level13 level36)
(sum level23 level14 level37)
(sum level23 level15 level38)
(sum level23 level20 level43)
(sum level23 level23 level46)
(sum level24 level4 level28)
(sum level24 level13 level37)
(sum level24 level14 level38)
(sum level24 level15 level39)
(sum level24 level20 level44)
(sum level24 level23 level47)
(sum level25 level4 level29)
(sum level25 level13 level38)
(sum level25 level14 level39)
(sum level25 level15 level40)
(sum level25 level20 level45)
(sum level25 level23 level48)
(sum level26 level4 level30)
(sum level26 level13 level39)
(sum level26 level14 level40)
(sum level26 level15 level41)
(sum level26 level20 level46)
(sum level26 level23 level49)
(sum level27 level4 level31)
(sum level27 level13 level40)
(sum level27 level14 level41)
(sum level27 level15 level42)
(sum level27 level20 level47)
(sum level27 level23 level50)
(sum level28 level4 level32)
(sum level28 level13 level41)
(sum level28 level14 level42)
(sum level28 level15 level43)
(sum level28 level20 level48)
(sum level28 level23 level51)
(sum level29 level4 level33)
(sum level29 level13 level42)
(sum level29 level14 level43)
(sum level29 level15 level44)
(sum level29 level20 level49)
(sum level29 level23 level52)
(sum level30 level4 level34)
(sum level30 level13 level43)
(sum level30 level14 level44)
(sum level30 level15 level45)
(sum level30 level20 level50)
(sum level30 level23 level53)
(sum level31 level4 level35)
(sum level31 level13 level44)
(sum level31 level14 level45)
(sum level31 level15 level46)
(sum level31 level20 level51)
(sum level31 level23 level54)
(sum level32 level4 level36)
(sum level32 level13 level45)
(sum level32 level14 level46)
(sum level32 level15 level47)
(sum level32 level20 level52)
(sum level32 level23 level55)
(sum level33 level4 level37)
(sum level33 level13 level46)
(sum level33 level14 level47)
(sum level33 level15 level48)
(sum level33 level20 level53)
(sum level33 level23 level56)
(sum level34 level4 level38)
(sum level34 level13 level47)
(sum level34 level14 level48)
(sum level34 level15 level49)
(sum level34 level20 level54)
(sum level34 level23 level57)
(sum level35 level4 level39)
(sum level35 level13 level48)
(sum level35 level14 level49)
(sum level35 level15 level50)
(sum level35 level20 level55)
(sum level35 level23 level58)
(sum level36 level4 level40)
(sum level36 level13 level49)
(sum level36 level14 level50)
(sum level36 level15 level51)
(sum level36 level20 level56)
(sum level36 level23 level59)
(sum level37 level4 level41)
(sum level37 level13 level50)
(sum level37 level14 level51)
(sum level37 level15 level52)
(sum level37 level20 level57)
(sum level37 level23 level60)
(sum level38 level4 level42)
(sum level38 level13 level51)
(sum level38 level14 level52)
(sum level38 level15 level53)
(sum level38 level20 level58)
(sum level38 level23 level61)
(sum level39 level4 level43)
(sum level39 level13 level52)
(sum level39 level14 level53)
(sum level39 level15 level54)
(sum level39 level20 level59)
(sum level39 level23 level62)
(sum level40 level4 level44)
(sum level40 level13 level53)
(sum level40 level14 level54)
(sum level40 level15 level55)
(sum level40 level20 level60)
(sum level40 level23 level63)
(sum level41 level4 level45)
(sum level41 level13 level54)
(sum level41 level14 level55)
(sum level41 level15 level56)
(sum level41 level20 level61)
(sum level41 level23 level64)
(sum level42 level4 level46)
(sum level42 level13 level55)
(sum level42 level14 level56)
(sum level42 level15 level57)
(sum level42 level20 level62)
(sum level42 level23 level65)
(sum level43 level4 level47)
(sum level43 level13 level56)
(sum level43 level14 level57)
(sum level43 level15 level58)
(sum level43 level20 level63)
(sum level43 level23 level66)
(sum level44 level4 level48)
(sum level44 level13 level57)
(sum level44 level14 level58)
(sum level44 level15 level59)
(sum level44 level20 level64)
(sum level44 level23 level67)
(sum level45 level4 level49)
(sum level45 level13 level58)
(sum level45 level14 level59)
(sum level45 level15 level60)
(sum level45 level20 level65)
(sum level45 level23 level68)
(sum level46 level4 level50)
(sum level46 level13 level59)
(sum level46 level14 level60)
(sum level46 level15 level61)
(sum level46 level20 level66)
(sum level46 level23 level69)
(sum level47 level4 level51)
(sum level47 level13 level60)
(sum level47 level14 level61)
(sum level47 level15 level62)
(sum level47 level20 level67)
(sum level47 level23 level70)
(sum level48 level4 level52)
(sum level48 level13 level61)
(sum level48 level14 level62)
(sum level48 level15 level63)
(sum level48 level20 level68)
(sum level48 level23 level71)
(sum level49 level4 level53)
(sum level49 level13 level62)
(sum level49 level14 level63)
(sum level49 level15 level64)
(sum level49 level20 level69)
(sum level49 level23 level72)
(sum level50 level4 level54)
(sum level50 level13 level63)
(sum level50 level14 level64)
(sum level50 level15 level65)
(sum level50 level20 level70)
(sum level50 level23 level73)
(sum level51 level4 level55)
(sum level51 level13 level64)
(sum level51 level14 level65)
(sum level51 level15 level66)
(sum level51 level20 level71)
(sum level51 level23 level74)
(sum level52 level4 level56)
(sum level52 level13 level65)
(sum level52 level14 level66)
(sum level52 level15 level67)
(sum level52 level20 level72)
(sum level52 level23 level75)
(sum level53 level4 level57)
(sum level53 level13 level66)
(sum level53 level14 level67)
(sum level53 level15 level68)
(sum level53 level20 level73)
(sum level53 level23 level76)
(sum level54 level4 level58)
(sum level54 level13 level67)
(sum level54 level14 level68)
(sum level54 level15 level69)
(sum level54 level20 level74)
(sum level54 level23 level77)
(sum level55 level4 level59)
(sum level55 level13 level68)
(sum level55 level14 level69)
(sum level55 level15 level70)
(sum level55 level20 level75)
(sum level55 level23 level78)
(sum level56 level4 level60)
(sum level56 level13 level69)
(sum level56 level14 level70)
(sum level56 level15 level71)
(sum level56 level20 level76)
(sum level56 level23 level79)
(sum level57 level4 level61)
(sum level57 level13 level70)
(sum level57 level14 level71)
(sum level57 level15 level72)
(sum level57 level20 level77)
(sum level57 level23 level80)
(sum level58 level4 level62)
(sum level58 level13 level71)
(sum level58 level14 level72)
(sum level58 level15 level73)
(sum level58 level20 level78)
(sum level58 level23 level81)
(sum level59 level4 level63)
(sum level59 level13 level72)
(sum level59 level14 level73)
(sum level59 level15 level74)
(sum level59 level20 level79)
(sum level59 level23 level82)
(sum level60 level4 level64)
(sum level60 level13 level73)
(sum level60 level14 level74)
(sum level60 level15 level75)
(sum level60 level20 level80)
(sum level60 level23 level83)
(sum level61 level4 level65)
(sum level61 level13 level74)
(sum level61 level14 level75)
(sum level61 level15 level76)
(sum level61 level20 level81)
(sum level61 level23 level84)
(sum level62 level4 level66)
(sum level62 level13 level75)
(sum level62 level14 level76)
(sum level62 level15 level77)
(sum level62 level20 level82)
(sum level62 level23 level85)
(sum level63 level4 level67)
(sum level63 level13 level76)
(sum level63 level14 level77)
(sum level63 level15 level78)
(sum level63 level20 level83)
(sum level63 level23 level86)
(sum level64 level4 level68)
(sum level64 level13 level77)
(sum level64 level14 level78)
(sum level64 level15 level79)
(sum level64 level20 level84)
(sum level64 level23 level87)
(sum level65 level4 level69)
(sum level65 level13 level78)
(sum level65 level14 level79)
(sum level65 level15 level80)
(sum level65 level20 level85)
(sum level65 level23 level88)
(sum level66 level4 level70)
(sum level66 level13 level79)
(sum level66 level14 level80)
(sum level66 level15 level81)
(sum level66 level20 level86)
(sum level66 level23 level89)
(sum level67 level4 level71)
(sum level67 level13 level80)
(sum level67 level14 level81)
(sum level67 level15 level82)
(sum level67 level20 level87)
(sum level67 level23 level90)
(sum level68 level4 level72)
(sum level68 level13 level81)
(sum level68 level14 level82)
(sum level68 level15 level83)
(sum level68 level20 level88)
(sum level68 level23 level91)
(sum level69 level4 level73)
(sum level69 level13 level82)
(sum level69 level14 level83)
(sum level69 level15 level84)
(sum level69 level20 level89)
(sum level69 level23 level92)
(sum level70 level4 level74)
(sum level70 level13 level83)
(sum level70 level14 level84)
(sum level70 level15 level85)
(sum level70 level20 level90)
(sum level70 level23 level93)
(sum level71 level4 level75)
(sum level71 level13 level84)
(sum level71 level14 level85)
(sum level71 level15 level86)
(sum level71 level20 level91)
(sum level71 level23 level94)
(sum level72 level4 level76)
(sum level72 level13 level85)
(sum level72 level14 level86)
(sum level72 level15 level87)
(sum level72 level20 level92)
(sum level72 level23 level95)
(sum level73 level4 level77)
(sum level73 level13 level86)
(sum level73 level14 level87)
(sum level73 level15 level88)
(sum level73 level20 level93)
(sum level73 level23 level96)
(sum level74 level4 level78)
(sum level74 level13 level87)
(sum level74 level14 level88)
(sum level74 level15 level89)
(sum level74 level20 level94)
(sum level74 level23 level97)
(sum level75 level4 level79)
(sum level75 level13 level88)
(sum level75 level14 level89)
(sum level75 level15 level90)
(sum level75 level20 level95)
(sum level75 level23 level98)
(sum level76 level4 level80)
(sum level76 level13 level89)
(sum level76 level14 level90)
(sum level76 level15 level91)
(sum level76 level20 level96)
(sum level76 level23 level99)
(sum level77 level4 level81)
(sum level77 level13 level90)
(sum level77 level14 level91)
(sum level77 level15 level92)
(sum level77 level20 level97)
(sum level77 level23 level100)
(sum level78 level4 level82)
(sum level78 level13 level91)
(sum level78 level14 level92)
(sum level78 level15 level93)
(sum level78 level20 level98)
(sum level78 level23 level101)
(sum level79 level4 level83)
(sum level79 level13 level92)
(sum level79 level14 level93)
(sum level79 level15 level94)
(sum level79 level20 level99)
(sum level79 level23 level102)
(sum level80 level4 level84)
(sum level80 level13 level93)
(sum level80 level14 level94)
(sum level80 level15 level95)
(sum level80 level20 level100)
(sum level80 level23 level103)
(sum level81 level4 level85)
(sum level81 level13 level94)
(sum level81 level14 level95)
(sum level81 level15 level96)
(sum level81 level20 level101)
(sum level81 level23 level104)
(sum level82 level4 level86)
(sum level82 level13 level95)
(sum level82 level14 level96)
(sum level82 level15 level97)
(sum level82 level20 level102)
(sum level82 level23 level105)
(sum level83 level4 level87)
(sum level83 level13 level96)
(sum level83 level14 level97)
(sum level83 level15 level98)
(sum level83 level20 level103)
(sum level84 level4 level88)
(sum level84 level13 level97)
(sum level84 level14 level98)
(sum level84 level15 level99)
(sum level84 level20 level104)
(sum level85 level4 level89)
(sum level85 level13 level98)
(sum level85 level14 level99)
(sum level85 level15 level100)
(sum level85 level20 level105)
(sum level86 level4 level90)
(sum level86 level13 level99)
(sum level86 level14 level100)
(sum level86 level15 level101)
(sum level87 level4 level91)
(sum level87 level13 level100)
(sum level87 level14 level101)
(sum level87 level15 level102)
(sum level88 level4 level92)
(sum level88 level13 level101)
(sum level88 level14 level102)
(sum level88 level15 level103)
(sum level89 level4 level93)
(sum level89 level13 level102)
(sum level89 level14 level103)
(sum level89 level15 level104)
(sum level90 level4 level94)
(sum level90 level13 level103)
(sum level90 level14 level104)
(sum level90 level15 level105)
(sum level91 level4 level95)
(sum level91 level13 level104)
(sum level91 level14 level105)
(sum level92 level4 level96)
(sum level92 level13 level105)
(sum level93 level4 level97)
(sum level94 level4 level98)
(sum level95 level4 level99)
(sum level96 level4 level100)
(sum level97 level4 level101)
(sum level98 level4 level102)
(sum level99 level4 level103)
(sum level100 level4 level104)
(sum level101 level4 level105)

(connected l0 l1)
(fuelcost level14 l0 l1)
(connected l0 l2)
(fuelcost level4 l0 l2)
(connected l0 l4)
(fuelcost level15 l0 l4)
(connected l1 l0)
(fuelcost level14 l1 l0)
(connected l1 l2)
(fuelcost level23 l1 l2)
(connected l2 l0)
(fuelcost level4 l2 l0)
(connected l2 l1)
(fuelcost level23 l2 l1)
(connected l2 l3)
(fuelcost level20 l2 l3)
(connected l2 l4)
(fuelcost level13 l2 l4)
(connected l3 l2)
(fuelcost level20 l3 l2)
(connected l3 l4)
(fuelcost level13 l3 l4)
(connected l4 l0)
(fuelcost level15 l4 l0)
(connected l4 l2)
(fuelcost level13 l4 l2)
(connected l4 l3)
(fuelcost level13 l4 l3)

(at t0 l0)
(fuel t0 level105)
(= (total-cost) 0)

(at p0 l1)
(at p1 l2)
(at p2 l0)
(at p3 l0)
(at p4 l3)
(at p5 l0)
(at p6 l4)
(at p7 l1)
(at p8 l0)
(at p9 l0)
(at p10 l1)
(at p11 l2)
(at p12 l1)
(at p13 l4)
)

(:goal
(and
(at p0 l3)
(at p1 l0)
(at p2 l4)
(at p3 l2)
(at p4 l1)
(at p5 l2)
(at p6 l2)
(at p7 l0)
(at p8 l1)
(at p9 l3)
(at p10 l4)
(at p11 l3)
(at p12 l2)
(at p13 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 0 of 14
2. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 0 of 14
3. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 14
4. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 14
5. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 14
6. (drive t0 l0 l1 level91 level14 level105)
   deleted: (at t0 l0) (fuel t0 level105)
   added: (at t0 l1) (fuel t0 level91)
   goals met: 0 of 14
7. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 1 of 14
8. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 1 of 14
9. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 1 of 14
10. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 1 of 14
11. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 1 of 14
12. (drive t0 l1 l2 level68 level23 level91)
   deleted: (at t0 l1) (fuel t0 level91)
   added: (at t0 l2) (fuel t0 level68)
   goals met: 1 of 14
13. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 2 of 14
14. (load p11 t0 l2)
   deleted: (at p11 l2)
   added: (in p11 t0)
   goals met: 2 of 14
15. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 2 of 14
16. (drive t0 l2 l4 level55 level13 level68)
   deleted: (at t0 l2) (fuel t0 level68)
   added: (at t0 l4) (fuel t0 level55)
   goals met: 2 of 14
17. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 3 of 14
18. (unload p10 t0 l4)
   deleted: (in p10 t0)
   added: (at p10 l4)
   goals met: 4 of 14
19. (load p6 t0 l4)
   deleted: (at p6 l4)
   added: (in p6 t0)
   goals met: 4 of 14
20. (load p13 t0 l4)
   deleted: (at p13 l4)
   added: (in p13 t0)
   goals met: 4 of 14
21. (drive t0 l4 l3 level42 level13 level55)
   deleted: (at t0 l4) (fuel t0 level55)
   added: (at t0 l3) (fuel t0 level42)
   goals met: 4 of 14
22. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 4 of 14
23. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 5 of 14
24. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 6 of 14
25. (unload p13 t0 l3)
   deleted: (in p13 t0)
   added: (at p13 l3)
   goals met: 7 of 14
26. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 8 of 14
27. (drive t0 l3 l2 level22 level20 level42)
   deleted: (at t0 l3) (fuel t0 level42)
   added: (at t0 l2) (fuel t0 level22)
   goals met: 8 of 14
28. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 9 of 14
29. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 10 of 14
30. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 11 of 14
31. (drive t0 l2 l0 level18 level4 level22)
   deleted: (at t0 l2) (fuel t0 level22)
   added: (at t0 l0) (fuel t0 level18)
   goals met: 11 of 14
32. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 12 of 14
33. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 13 of 14
34. (drive t0 l0 l1 level4 level14 level18)
   deleted: (at t0 l0) (fuel t0 level18)
   added: (at t0 l1) (fuel t0 level4)
   goals met: 13 of 14
35. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 14 of 14
